tap 'homebrew/bundle'
tap 'homebrew/cask-fonts'
tap 'homebrew/services'
tap 'ngrok/ngrok'
brew 'zstd'
brew 'awscli'
brew 'bat'
brew 'colordiff'
brew 'delta'
brew 'direnv'
brew 'difftastic'
brew 'fd'
brew 'font-hackgen'
brew 'font-hackgen-nerd'
brew 'fzf'
brew 'gh'
brew 'ghq'
brew 'git'
brew 'gitmoji'
brew 'git-secrets'
brew 'imagemagick'
brew 'jesseduffield/lazygit/lazygit'
brew 'jq'
brew 'mysql'
brew 'neovim'
brew 'peco'
brew 'pnpm'
brew 'sheldon'
brew 'starship'
brew 'ruby-build'
brew 'rbenv'
brew 'redis', restart_service: true
brew 'rename'
brew 'mise'
brew 'tmux'
brew 'tree'
brew 'watchman'
brew 'wget'
brew 'yarn'
cask 'arc'
cask 'chromedriver'
cask 'cursor'
cask 'ngrok'
cask 'orbstack'
cask 'postman'
cask 'setapp'
cask 'wezterm'
